---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementParameterFilter
source: html/9393f5e4-34eb-793f-bf88-f114c0f24eb9.htm
---
# ElementParameterFilter Members

Constructs a new instance of an ElementParameterFilter from a single rule.